CSI API ETABS v1
cPropArea.SetDeck_1 Method
 Initializes a deck property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDeck_1(
	string Name,
	eDeckType DeckType,
	string SlabFillMatProp,
	string DeckMatProp,
	double SlabDepth,
	double RibDepth,
	double RibWidthTop,
	double RibWidthBot,
	double RibSpacing,
	double DeckShearThickness,
	double DeckUnitWeight,
	double ShearStudDia,
	double ShearStudHs,
	double ShearStudFu,
	int color = -1,
	string notes = "",
	string GUID = ""
)
Function SetDeck_1 (
	Name As String,
	DeckType As eDeckType,
	SlabFillMatProp As String,
	DeckMatProp As String,
	SlabDepth As Double,
	RibDepth As Double,
	RibWidthTop As Double,
	RibWidthBot As Double,
	RibSpacing As Double,
	DeckShearThickness As Double,
	DeckUnitWeight As Double,
	ShearStudDia As Double,
	ShearStudHs As Double,
	ShearStudFu As Double,
	Optional color As Integer = -1,
	Optional notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim DeckType As eDeckType
Dim SlabFillMatProp As String
Dim DeckMatProp As String
Dim SlabDepth As Double
Dim RibDepth As Double
Dim RibWidthTop As Double
Dim RibWidthBot As Double
Dim RibSpacing As Double
Dim DeckShearThickness As Double
Dim DeckUnitWeight As Double
Dim ShearStudDia As Double
Dim ShearStudHs As Double
Dim ShearStudFu As Double
Dim color As Integer
Dim notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetDeck_1(Name,
	DeckType, SlabFillMatProp, DeckMatProp,
	SlabDepth, RibDepth, RibWidthTop,
	RibWidthBot, RibSpacing, DeckShearThickness,
	DeckUnitWeight, ShearStudDia, ShearStudHs,
	ShearStudFu, color, notes, GUID)
int SetDeck_1(
	String^ Name,
	eDeckType DeckType,
	String^ SlabFillMatProp,
	String^ DeckMatProp,
	double SlabDepth,
	double RibDepth,
	double RibWidthTop,
	double RibWidthBot,
	double RibSpacing,
	double DeckShearThickness,
	double DeckUnitWeight,
	double ShearStudDia,
	double ShearStudHs,
	double ShearStudFu,
	int color = -1,
	String^ notes = L"",
	String^ GUID = L""
)
abstract SetDeck_1 :
        Name : string *
        DeckType : eDeckType *
        SlabFillMatProp : string *
        DeckMatProp : string *
        SlabDepth : float *
        RibDepth : float *
        RibWidthTop : float *
        RibWidthBot : float *
        RibSpacing : float *
        DeckShearThickness : float *
        DeckUnitWeight : float *
        ShearStudDia : float *
        ShearStudHs : float *
        ShearStudFu : float *
        ?color : int *
        ?notes : string *
        ?GUID : string
(* Defaults:
        let _color = defaultArg color -1
        let _notes = defaultArg notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
 The name of a deck property. If this is an existing property, that property is modified; otherwise, a new property is added.
DeckType
Type: ETABSv1.eDeckType
 This is one of the following items in the eDeckType enumeration, which is Filled, Unfilled, or SolidSlab
SlabFillMatProp
Type: System.String
The name of the material property for the slab/fill property. This applies if DeckType is Filled or SolidSlab
DeckMatProp
Type: System.String
The name of the material property for the deck property. This applies if DeckType is Filled or Unfilled
SlabDepth
Type: System.Double
Slab Depth, tc. This applies if DeckType is Filled or SolidSlab
RibDepth
Type: System.Double
Rib Depth, hr. This applies if DeckType is Filled or Unfilled
RibWidthTop
Type: System.Double
Rib Width Top, wrt. This applies if DeckType is Filled or Unfilled
RibWidthBot
Type: System.Double
Rib Width Bottom, wrb. This applies if DeckType is Filled or Unfilled
RibSpacing
Type: System.Double
Rib Spacing, sr. This applies if DeckType is Filled or Unfilled
DeckShearThickness
Type: System.Double
Deck Shear Thickness. This applies if DeckType is Filled or Unfilled
DeckUnitWeight
Type: System.Double
Deck Unit Weight. This applies if DeckType is Filled or Unfilled
ShearStudDia
Type: System.Double
Shear Stud Diameter. This applies if DeckType is Filled or SolidSlab
ShearStudHs
Type: System.Double
Shear Stud Height, hs. This applies if DeckType is Filled or SolidSlab
ShearStudFu
Type: System.Double
Shear Stud Tensile Strength, Fu. This applies if DeckType is Filled or SolidSlab
color (Optional)
Type: System.Int32
The display color assigned to the property.
notes (Optional)
Type: System.String
The notes, if any, assigned to the property.
GUID (Optional)
Type: System.String
The GUID (global unique identifier), if any, assigned to the property.
Return Value
Type: Int32
 Returns zero if the property is successfully initialized; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim DeckType As eDeckType
       Dim SlabDepth As Double
       Dim RibDepth As Double
       Dim RibWidthTop As Double
       Dim RibWidthBot As Double
       Dim RibSpacing As Double
       Dim DeckShearThickness As Double
       Dim DeckUnitWeight As Double
       Dim ShearStudDia As Double
       Dim ShearStudHs As Double
       Dim ShearStudFu As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
       Name = "MyShellProp1A"
       DeckType = eDeckType.Filled
       SlabFillMatProp = "4000Psi"
       DeckMatProp = "A992Fy50"
       SlabDepth = 15.6
       RibDepth = 1.1
       RibWidthTop = 2.3
       RibWidthBot = 2.4
       RibSpacing = 7
       DeckShearThickness = 5
       DeckUnitWeight = 3.1
       ShearStudDia = 1.02
       ShearStudHt = 4.4
       ShearStudFu = 2.01
       ret = mySapModel.PropArea.SetDeck_1(Name, DeckType, SlabFillMatProp, DeckMatProp, SlabDepth, RibDepth, RibWidthTop, RibWidthBot, RibSpacing, DeckShearThickness, DeckUnitWeight, ShearStudDia, ShearStudHt, ShearStudFu, color, notes, GUID)
       DeckType = eDeckType.SolidSlab
       SlabFillMatProp = ""
       DeckMatProp = ""
       SlabDepth = 0
       RibDepth = 0
       RibWidthTop = 0
       RibWidthBot = 0
       RibSpacing = 0
       DeckShearThickness = 0
       DeckUnitWeight = 0
       ShearStudDia = 0
       ShearStudHt = 0
       ShearStudFu = 0
    'get area property data
       ret = mySapModel.PropArea.GetDeck_1(Name, DeckType, SlabFillMatProp, DeckMatProp, SlabDepth, RibDepth, RibWidthTop, RibWidthBot, RibSpacing, DeckShearThickness, DeckUnitWeight, ShearStudDia, ShearStudHt, ShearStudFu, color, notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace